{"path":"working-at-deeson/pay-scales","templateID":0,"sharedPropsHashes":{"menuItems":"Gbcro"},"localProps":{"page":{"id":"W7fkjhQAACoAfkib","type":"page","slug":"working-at-deeson/pay-scales","title":"Pay","content":"<h1>Pay.</h1><p>We want everyone to be paid fairly and sustainably for their work at Deeson. We want the process of how pay is set and changed to be as transparent as possible.</p><p>In January 2018, following more than four months of consultation and detailed research, we launched our transparent pay scheme. You can read more about how we did this <a  href=\"https://www.deeson.co.uk/blog/taking-transparent-approach-pay-and-rewardhttps://\">here</a>.</p><h2>Principles.</h2><p>The pay scheme was designed to fit with a number of principles for how pay is worked out at Deeson.</p><p>Our pay and reward scheme is designed to:</p><ul><li>Support our aim to build a long-term, stable, diverse and high performing team.</li><li>Balance financial and non-financial benefits for team members.</li><li>Be competitive to attract and retain team members who value working at Deeson.</li><li>Be non-negotiable, so pay and reward is independent of an individual’s personal negotiation and influencing skills.</li><li>Be open and transparent within the agency and outside the agency.</li><li>Have a published pay scale linked to each role (defined by job scorecards).</li><li>Ensure the business remains sustainable through transparency of the costs to the company of pay and other forms of reward.</li><li>Be based on measurable factors as far as possible.</li><li>Be as location-independent as possible but recognise that’s not always possible.</li><li>More closely reflect the relationship between the impact of roles and the company’s overall performance.</li><li>Provide a clear and fair process for review of pay for existing team members.</li></ul><h2>Our current pay scales.</h2><p>The pay scales for roles at Deeson are below:</p><ul><li><a  href=\"https://deeson-handbook.cdn.prismic.io/deeson-handbook/ada7019e-7fc5-4e92-b32a-84e366ed4b47_Pay+scales+-+2020_21+-+handbook+version++%285%29.pdf\">Pay scales - 2020/2021</a></li></ul><p>The scales are reviewed every March as part of our annual budget setting for the financial year (1 April to 31 March).</p><p>The evidence-base that we have used to look at the external market for potentially comparable roles is <a  href=\"https://docs.google.com/spreadsheets/d/11CT5g_p4aFzeL5XPckNks_nTAxTrJipliOvFRv8TZ-k/edit#gid=452421314\">here</a>.</p><p>Team members can add evidence that they see, such as job adverts, articles or salary surveys to this sheet, so it will be included in the next review of pay scales. To add evidence, just send it to the Managing Director via Slack at any time.</p><h2>How we link impact and pay.</h2><p>The basics of our scheme are explained below:</p><ul><li>Every role has a job scorecard that sets out what we expect team members to achieve in their role.</li><li>Every quarter in 1:1 meetings, Deeson team members have an assessment of the impact that they&#39;re having, against the outcomes in the job scorecard. This is what we call an impact rating.</li><li>Each year in March, we set pay scales for each role for the financial year ahead – based on transparent evidence from a range of sources.</li><li>We also make sure that the pay scales are affordable for the business, by setting pay scales alongside our budget planning every financial year and ensuring our total budgeted costs for pay don’t exceed the industry benchmark.</li><li>We have a transparent way that pay is reviewed and increased in line with performance in a role – based on impact ratings over three consecutive assessments.</li><li>We have a transparent way that team members can progress into new roles and be rewarded accordingly.</li><li>We have a transparent and non-negotiable approach to pay setting for new recruits to the Deeson team.</li></ul><h2>Getting a pay review.</h2><p>For more information about how pay reviews are undertaken please visit the <a  href=\"https://handbook.deeson.co.uk/working-at-deeson/pay-review/\">pay review page</a>.</p><p><em>This information is for team members employed by Deeson Group Ltd.</em></p>","lastModified":"2020-08-20T12:52:07+0000","slices":[]}}}
