{"path":"working-at-deeson/training","templateID":0,"sharedPropsHashes":{"menuItems":"Z1ClcRO"},"localProps":{"page":{"id":"W7foRhQAACwAflkc","type":"page","slug":"working-at-deeson/training","title":"Unlimited training budget","content":"<h1>Unlimited training budget.</h1><p>The work we do for clients changes rapidly and that means we need to continually invest in our own skills and experiences.</p><p>Each Deeson team member has an unlimited training budget that enables them to do this.</p><p>The unlimited training budget is managed through our Professional Development Programme (PDP) scheme.</p><p>This is a structured self-reflection process that each team member undertakes annually with their line manager.</p><p>It incorporates peer, client and manager feedback, to help each team member get a rounded view of their strengths and opportunities for development.</p><p>The process also looks at the needs of the team member&#39;s current role and their career ambitions as well.</p><p>Once the PDP is finalised, each team member is responsible for planning and undertaking the activities set out in their plan for the year.</p><p>The range of activities included in PDPs is wide. It can include things like:</p><ul><li>Training courses (online and face-to-face).</li><li>Shadowing.</li><li>Mentoring.</li><li>Coaching as coach or coachee.</li><li>Working on different types of project.</li><li>Secondment.</li><li>Professional qualifications.</li><li>Meet-ups and events.</li><li>Public speaking.</li><li>Conferences.</li><li>Personal study.</li><li>Reflective practice.</li></ul><p>There are no limits to what can be considered for inclusion in a PDP – what&#39;s important is getting the right mix of activities that will help a team member develop and be deliverable alongside their role at Deeson.</p><p>For formal qualifications and courses which cost more than £500, we ask team members to commit to repaying some of the training budget if they leave Deeson within two years:</p><ul><li>if a team member leaves the company before or while successfully completing the qualification/course, we ask for full repayment of costs incurred to date.</li><li>if a team member leaves within one year of successfully completing the qualification/course, we ask for full repayment of costs. </li><li>if a team member leaves within one and two years of successfully completing the qualification/course, we ask for 50% repayment of the costs. </li><li>if a team member leaves more than two years after successfully completing the qualification/course, no costs are repayable.</li></ul><p>This requirement for repayment may be waived at the Managing Director&#39;s discretion.</p><p><em>This information is for team members employed by Deeson Group Ltd.</em></p>","lastModified":"2019-12-02T09:53:38+0000"}}}
