{"path":"working-at-deeson/equipment","templateID":0,"sharedPropsHashes":{"menuItems":"ZiKj0z"},"localProps":{"page":{"id":"W7flOxQAACwAfkuj","type":"page","slug":"working-at-deeson/equipment","title":"Equipment budget","content":"<h1>Equipment budget.</h1><h2>The basics.</h2><p>Deeson provides all team members with a laptop and core software.</p><p>In the London and Canterbury offices, we also provide things like keyboards, screens, internet access and stationery.</p><p>Most of us also have extra tools we need to be able to do our work efficiently. That might be a bit of kit to use with your Mac, some specialist software or some hardware you want to experiment with.</p><p>The company provides a budget of up to £500 to each team member each calendar year, to spend at their discretion on anything that helps them do their job at Deeson better.</p><p>What you spend that on is up to you – spend the money like it was your own.</p><p>But don’t just spend it because it’s there - money is obviously a valuable resource we all worked hard for.</p><p>No-one pre-approves what you spend it on. Be prepared to share the resource with your colleagues if need be.</p><p>To use your allowance, buy the item/service/thing, add it to the <a  href=\"https://docs.google.com/a/deeson.co.uk/spreadsheets/d/1jOTBKmHVrgcQGbvAVt8ta7c1UtK7pZeAhwgr6auuCfo/edit?usp=drive_web\">tool list</a> and add to Receipt Bank for approval.</p><p>Where possible, get someone with a company card to make the payment, although you can buy it on a personal credit card and be reimbursed by BACS. We also have a company Amazon account through which purchases can be made - speak to Hannah S for more details.</p><h2>The small print.</h2><ul><li>Anything you buy remains company property.</li><li>You need to take good care of it.</li><li>If you leave, you need to return any equipment purchased under this scheme, along with other company kit.</li><li>If you’re using it for non-work purposes and you break it. then you need to replace it at your own cost.</li><li>There’s an <a  href=\"https://docs.google.com/a/deeson.co.uk/spreadsheets/d/1jOTBKmHVrgcQGbvAVt8ta7c1UtK7pZeAhwgr6auuCfo/edit?usp=drive_web\">open list</a> of who’s got/bought what, so that everyone can share tools where appropriate.</li></ul><p><em>This information is for team members employed by Deeson Group Ltd and Deeson Publishing Ltd.</em></p>","lastModified":"2018-10-05T22:27:10+0000"}}}
