{"path":"company-policies/conference-policy","templateID":0,"sharedPropsHashes":{},"localProps":{"page":{"id":"W7frexQAACsAfmeU","type":"page","slug":"company-policies/conference-policy","title":"Conference attendance","content":"<h1>Conference attendance.</h1><p><em>This policy applies to team members employed by Deeson Group Ltd.</em></p><p>We encourage our team members to attend relevant conferences for personal development and to promote our agnecy around the industry.</p><p>If you&#39;d like to attend a conference/event, you need to talk this through with your Chapter Lead.</p><p>The things you&#39;ll need to talk about include:</p><ol><li>Relevance of the conference/event to your role.</li><li>Significance of the conference in the industry (looking at numbers usually attending and quality of the speakers or past speakers).</li><li>Distance from you.</li><li>Are you assisting with the running of the conference?</li><li>Are you speaking at the conference or chairing a session?</li><li>Will you be writing a blog post about your experiences within a week of attending?</li><li>Will you be providing a presentation to your team about the content of the conference within two weeks of attending?</li><li>Can your Chapter and projects spare you for the days of the conference? This is easier to answer the more notice you give; conferences are usually scheduled six months ahead of time.</li><li>Do you think that Deeson should be sponsoring the conference?</li><li>Have you missed out on conference attendance previously because too many people wanted to go?</li><li>What is the cost of the conference to Deeson? Please provide a breakdown, including the cost of transport (approx), cost of accomodation (approx), cost of subsistence (approx), cost of the tickets and the lost revenue, and the cost if working days will be missed to attend (this should be worked out at the current hourly rate).</li></ol><p>The Chapter Lead will consider the merits of conference attendance based on your case. If many people want to attend, we may have to limit the total numbers and will take into account, if this has happened to you previously. The decision will be made by the Chapter Lead and Tim Deeson, keeper of the Deeson purse.</p><p>If accepted, Deeson will provide the following:</p><ol><li>Paid attendance to one or more days (if Deeson is sponsoring the conference then tickets are usually included in the sponsorship package).</li><li>Paid return travel.</li><li>Accommodation costs for yourself if required, depending on the distance required to travel.</li><li>Costs of an evening meal for yourself if staying overnight (this follows the same rules as usual expenses policies around food and drink).</li></ol><p>If the conference or travel time to attend the event is over a weekend, it is not considered a working day and Deeson does not usually provide time off in lieu.</p><p>If rejected, Deeson will provide a reason.</p>"}}}
