{"path":"working-at-deeson/tools-purchasing-and-equipment","templateID":0,"sharedPropsHashes":{"menuItems":"2n0Nyl"},"localProps":{"page":{"id":"W7frERQAAC0AfmW2","type":"page","slug":"working-at-deeson/tools-purchasing-and-equipment","title":"Tools, purchasing and equipment","content":"<h1>Tools, purchasing and equipment.</h1><h2>I really need Widget X to work from home better? Why haven’t we experimented with Tech Y already?</h2><p>The company provides a laptop and core software. In the company&#39;s offices we also provide things like keyboards, screens, internet access and stationery.</p><p>However, most of us also have extra tools that we need to be able to do our work efficiently. That might be a bit of kit to use with your Mac, some specialist software or some hardware you want to experiment with.</p><p>The company provides a budget of up to £500 for each team member each year to spend at their discretion, on anything that helps them do their job at Deeson better.</p><p>What you spend that on is up to you – spend the money like it was your own. But don’t just spend it because it’s there – money is obviously a valuable resource we’ve all worked hard for.</p><p>No-one pre-approves what you spend it on. Be prepared to share the resource with your colleagues if need be.</p><p>To use your allowance, buy the item/service/thing, add it to the <a  href=\"https://docs.google.com/a/deeson.co.uk/spreadsheets/d/1jOTBKmHVrgcQGbvAVt8ta7c1UtK7pZeAhwgr6auuCfo/edit?usp=drive_web\">tool list</a> and add to Receipt Bank for approval. Where possible, get someone with a company credit card to make the payment, although you can buy it on a personal credit card and be reimbursed by BACS.</p><h2>How do I purchase equipment for the office, print for a client etc?</h2><p>Purchases by credit card are sent through Receipt Bank for approval. Purchases that are paid for later or that require a purchase order are entered via Xero only. Nothing needs to be added in both places.</p><h2>Does this include pens/paper/maracas/iPads?</h2><p>The company will supply printers, toner and printer paper.</p><p>Beyond that, you should buy what you need using your budget and look after it; this includes consumables such as notepads.</p><h2>What if I run out of budget?</h2><p>If you’ve used it effectively and you need more then you’ll get more.</p><h2>Who’s responsible for looking after what I buy?</h2><p>You. Buying resources at a company level is really inefficient – they often get lost or no-one knows where they are when they need them, so they get bought again and again.</p><p>Or we lose expensive things like iPads before a pitch because its everyone’s and no-one’s responsibility to look after them. We waste time searching for them, money buying them and it is bad for the environment – 100 AA batteries of unknown charge in a drawer is a fail.</p><h2>The small print.</h2><p>Anything you buy remains company property.</p><p>You need to take good care of it and if you leave you need to return it along with other company kit.</p><p>If you’re using it for non-work purposes and you break it then you need to replace it at your own cost.</p><p>There’s an open list of who’s got/bought what so that everyone can share. The onus is on you to check that we aren’t buying small amounts inefficiently, to get the best deal and that we don’t already have five Segways in the cellar.</p><p><em>This information is for team members employed by Deeson Group Ltd and Deeson Publishing Ltd.</em></p>","lastModified":"2018-10-05T22:52:04+0000"}}}
