{"path":"handbook/our-delivery-process","templateID":0,"sharedPropsHashes":{"menuItems":"2n0Nyl"},"localProps":{"page":{"id":"W7fjxxQAACsAfkUf","type":"page","slug":"handbook/our-delivery-process","title":"Our delivery process","content":"<h1>Our delivery framework.</h1><p>Our project process is defined by the specific needs of each client and each project. However, with the help of the Agile Business Consortium, we have adapted the <a  href=\"https://www.agilebusiness.org/what-is-dsdm\">DSDM framework</a> to help us to keep consistency across projects.</p><p>Our projects consist of a number of key phases: Pre-project → Feasibility → Foundations → Design Direction → Evolutionary Development</p><p>All projects consist of a Feasibility and Foundations phase before we commence development.</p><h2>Pre-project.</h2><p>As the name suggests, this is before the project begins and before any contracts are signed. It’s about getting to know the client, their needs and what the project will entail.</p><h2>Feasibility.</h2><p>This phase allows us to dive deeper into technical, design, budget and team agility questions and issues, to be able to assess and adjust scope and requirements for the project. It’ll include a Blueprint Workshop run by the Creative Director, Technical Director, the Project Lead and Delivery Manager.</p><h2>Foundations.</h2><p>There are a variety of tasks in Foundations, to make sure we are building the right thing in Evolutionary Development. During this phase we commonly undertake research, technical spikes, prototypes, user testing and agree the Design Direction.</p><p><strong>Key outcomes include:</strong></p><ul><li>Agreeing a high level Delivery Plan which outlines delivery dates and objectives.</li><li>At least the first <a  href=\"https://www.agilebusiness.org/content/timeboxing-0\">Timebox</a> of user stories are refined and estimated.</li><li>Definitions of Ready and Done are agreed.</li><li>Roles and responsibilities are agreed.</li></ul><p>The activities are flexible but the outcomes are fixed, and are assessed against this <a  href=\"https://docs.google.com/document/d/1GLer6Uml5cwS4Z9EpJtC1oLqAA7dJB8-g5Ni3CuY-Gc/edit\">checklist</a> of deliverables.</p><p>The length of this phase varies depending on the project but on average is between six and eight weeks.</p><h2>Design Direction.</h2><p>This is part of the Foundations phase, with the end goal being the overall Design Direction signed off by the client before Evolutionary Development starts. It’s an iterative process where key pages are presented to the client for feedback. We don’t commence development until the client has signed off on the Design Direction.</p><h2>Evolutionary Development.</h2><p>Evolutionary Development is an iterative process. We use Jira as the project management tool with a defined workflow. We’re planning development in Timeboxes (generally two weeks long) and make use of agile ceremonies to keep us on track.</p><p><strong>Agile ceremonies.</strong></p><ul><li><strong>Daily stand-ups</strong> – stand-ups are held with the client and each member of the team gives an update on what he/she did yesterday, what he/she are going to do today and if there are any blockers.</li><li><strong>Retrospective</strong> – held at the end of each Timebox to recognise the good, identify issues and take actions to improve future Timeboxes.</li><li><strong>Sizing</strong> – the development team estimate refined stories either in story points or hours.</li><li><strong>Demo meeting</strong> – part of the acceptance meeting with the client at the end of every Timebox and includes a demo of what has been completed.</li><li><strong>Timebox planning</strong> – the Development team, Business Ambassador and Delivery Manager decide on the next Timebox goal and what stories will be worked on, taking into account team capacity.</li></ul><p>To prioritise stories we use <a  href=\"https://www.agilebusiness.org/content/moscow-prioritisation\">MoSCoW prioritisation</a> – a technique for helping to understand and manage priorities following Must have, Should have, Could have, Won’t have this time categorisation – which helps us agree on a Timebox commitment and overall delivery plan.</p><p><strong>Additional ceremonies.</strong></p><ul><li>For internal project oversight, the Project Lead and Delivery Manager run weekly project review meetings.</li><li><a  href=\"https://docs.google.com/spreadsheets/d/11VQQvq7WoLPnD-JJ1wmFRH6xVQRINU74LbW8QtFA31k/edit#gid=0\">Fortnightly client and Delivery Manager check-ins</a> to celebrate achievements and/or discuss issues and concerns.</li><li>We send out a monthly satisfaction survey to our clients. The Project Lead will review any feedback and inform the team of any actions to be taken.</li></ul><p><strong>There is a more extensive description of the process regarding our adapted agile delivery methodology <a  href=\"https://docs.google.com/document/d/17aO5PCU5aKBxPIXeRnuvK76trgVbn10qjIuuZzB9zhA/edit\">here</a>.</strong></p><h2>Roles and responsibilities.</h2><p>As we grow and processes change, we keep iterating on roles and responsibilities. <a  href=\"https://handbook.deeson.co.uk/handbook/roles-at-deeson/\">Roles at Deeson</a> provides a general overview; <a  href=\"https://docs.google.com/spreadsheets/d/1xBxZNZarYJdkY7UCDrbMMMTaF3io5mVMqNA85fJnoDw/edit#gid=1040411215\">project roles and responsibilities</a> provides a more detailed list of accountabilities during a project&#39;s lifecycle.</p><p>Specifically, there are two key client side project roles:</p><p><strong>Business Visionary.</strong></p><ul><li>Budget holder.</li><li>Resolves business issues.</li><li>Makes financial decisions.</li><li>Enables and ensures fast progress throughout the project.</li></ul><p><strong>Business Ambassador.</strong></p><ul><li>Responsible for managing the prioritised requirement list in JIRA.</li><li>Responsible for signing off on a Timebox before it starts, including acceptance criteria on a feature level.</li><li>Responsible for attending Timebox planning sessions, demos and retrospectives.</li><li>Responsible for undertaking UAT and signing off features completed during the Timebox.</li></ul><h2>Useful resources.</h2><ul><li><a  href=\"http://funretro.github.io/distributed/\">Fun Retro</a> – a tool that allows distributed teams to have effective retrospectives.</li><li><a  href=\"https://plans-for-retrospectives.com/en/?id=90-128-91-21-34\">Retromat</a> – a great source of inspiration for running successful retrospectives.</li></ul>","lastModified":"2018-10-18T13:09:16+0000","slices":[]}}}
