{"path":"company-policies/maternity-and-paternity-policy","templateID":0,"sharedPropsHashes":{"menuItems":"2nsjHi"},"localProps":{"page":{"id":"W7ft-hQAACwAfnLY","type":"page","slug":"company-policies/maternity-and-paternity-policy","title":"Maternity, paternity and shared leave policy","content":"<h1>Maternity, paternity and shared leave policy.</h1><p><em>This policy applies to team members employed by Deeson Group Ltd and Deeson Publishing Ltd.</em></p><h2>Who is covered by this policy?</h2><ol><li>For maternity/adoption leave and pay: Any employee who has become pregnant or who has been matched with a child for adoption.</li><li>For shared parental leave: The partner of any such employee, whether or not they work for this organisation (subject to certain qualifying and earnings criteria); or an employee whose partner has become pregnant or been matched with a child for adoption.</li><li>For paternity leave and pay: Any employee of the organisation whose partner has become pregnant or been matched with a child for adoption.</li><li>For unpaid parental leave: Any employee with at least one year&#39;s service, who has a child under 18 years old.</li></ol><h2>What maternity or adoption leave am I entitled to?</h2><p>If you are an employee who is pregnant or adopting, you will be entitled to take up to 52 weeks maternity/adoption leave if you want to, irrespective of your length of service or earnings with the organisation.</p><p>Your pay during this period of leave depends on how long you&#39;ve worked for the company.</p><h3>Employed by the company for less than 26 weeks.</h3><p>There is no entitlement to maternity or adoption leave for team members who have worked for Deeson for less than 26 weeks.</p><h3>Employed by the company for between 26 and 104 weeks.</h3><p>If 15 weeks before the expected birth or adoption, you have been employed by us continuously for at least 26 weeks but less than 104 weeks, and your average weekly earnings are at least equal to the lower earnings limit for National Insurance contributions (<a  href=\"https://www.gov.uk/government/publications/rates-and-allowances-national-insurance-contributions/rates-and-allowances-national-insurance-contributions\">details</a>), your entitlement (including statutory maternity / adoption pay) will be:</p><ul><li><strong>First two weeks:</strong> 100% of average weekly earnings.</li><li><strong>Weeks 3, 4, 5 and 6:</strong> 90% of average weekly earnings.</li><li><strong>Weeks 7 to 39:</strong> Statutory rate set by the government each tax year or 90% of your average weekly earnings – whichever is the lower.</li><li><strong>Weeks 40 to 52:</strong> Unpaid.</li></ul><h3>Employed by the company for more than 104 weeks.</h3><p>If 15 weeks before the expected birth or adoption, you have been employed by us continuously for at least 104 weeks, and your average weekly earnings are at least equal to the lower earnings limit for National Insurance contributions (<a  href=\"https://www.gov.uk/government/publications/rates-and-allowances-national-insurance-contributions/rates-and-allowances-national-insurance-contributions\">details</a>) your entitlement (including statutory maternity/adoption pay) will be:</p><ul><li><strong>First 13 weeks:</strong> 100% of average weekly earnings.</li><li><strong>Weeks 14 to 26:</strong> 50% of your average weekly earnings or statutory rate set by the government each tax year – whichever is the higher.</li><li><strong>Weeks 27-39:</strong> Statutory rate set by the government each tax year or 90% of your average weekly earnings – whichever is the lower.</li><li><strong>Weeks 40-52:</strong> Unpaid.</li></ul><h2>What paternity leave am I entitled to?</h2><h3>Employed by the company for less than 52 weeks.</h3><p>There is no entitlement to paternity leave for team members who have worked for Deeson for less than 52 weeks.</p><h3>Employed by the company for more than 52 weeks.</h3><p>If 15 weeks before the expected birth or adoption, you have been employed by us continuously for at least 52 weeks, you will be entitled to two weeks&#39; paternity leave. This leave will be paid at your average weekly earnings.</p><h2>Parental leave.</h2><p>If you are a parent with a child who is under 18 years old then:</p><ul><li>After one year&#39;s service you can take up to 18 weeks&#39; unpaid parental leave for that child.</li><li>This allowance applies to each of your children but can only be taken in blocks of up to four weeks per year.</li></ul><h2>Leaving Deeson after maternity, adoption or paternity leave.</h2><p>Given our commitment to building a long-term, stable, diverse and high performing team, Deeson has chosen to put in place, a policy that pays well above the statutory minimum during maternity, adoption and paternity.</p><p>This means we do require team members to return to work following maternity, adoption and paternity for a set period, to remain eligible for the enhanced pay they have received.</p><p>If you leave Deeson following your return to work from a period of maternity, adoption or paternity leave, and have received pay above the statutory minimum, you will have to repay the enhanced pay as set out below:</p><h3>Leaving within six months of your return to work.</h3><p>If your final day of employment with Deeson is within six months of your return to work date after a period of maternity, adoption or paternity leave, the full enhanced maternity/adoption/paternity benefits above the statutory minimum would be repayable in full.</p><h3>Leaving within six and 12 months of your return to work.</h3><p>If your final day of employment with Deeson is between six and 12 months of your return to work date after a period of maternity, adoption or paternity leave, 50% of the enhanced maternity/adoption/paternity benefits above the statutory minimum would be repayable in full.</p><h3>Leaving more than 12 months after your reutrn to work.</h3><p>If your final day of employment with Deeson is more than 12 months after your return to work date following a period of maternity, adoption or paternity leave, there will be no repayment due.</p><h2>Am I entitled to share maternity/adoption leave and pay with my partner?</h2><p>Shared parental leave is designed to give parents/adopters more flexibility in how they share the care of their child in the first year following birth or adoption. If you are eligible, you can share up to 50 weeks leave, and can decide to be off work at the same time and/or take it in turns to have periods of leave to look after the child. To be eligible, you must meet the following criteria:</p><ul><li>You (or your partner) must be entitled to maternity/adoption leave, or statutory maternity/adoption pay (or maternity allowance from the government) and you must share the main responsibility for caring for the child with your partner.</li><li>In addition, you and your partner will also be required to follow a two-step process to establish eligibility as follows:</li></ul><p><strong>Step 1 - Continuity test:</strong> If you are seeking to take shared parental leave, one parent/adopter must have worked for the same employer for at least 26 weeks at the end of the 15th week before the week in which the child is due (or at the week in which an adopter was notified of having been matched with a child or adoption), and they should still be employed in the first week that shared parental leave is to be taken.</p><p>The other parent/adopter has to have worked for 26 weeks in the 66 weeks leading up to the due date and have earned above the maternity allowance threshold of £30 a week in 13 of the 66 weeks.</p><p><strong>Step 2 - Individual eligibility for pay:</strong> To qualify for shared parental pay, the parent/main adopter must, as well as passing the continuity test, also have earned an average salary of the National Insurance lower earnings limit or more, for the eight weeks prior to the 15th week before the expected birth/adoption.</p><p>Although the situation around pregnancy and adoption appears complex, it is normally quite straightforward to work out your entitlement. Therefore, as soon as you know you are pregnant or have been matched with a child for adoption, please let us know as soon as is practical. We will calculate your entitlement and the relevant dates for you.</p><h3>Additional resources</h3><p>We are supporters of The Tommy’s Pregnancy at Work scheme, which is designed to give organisations all the tools they need to provide the best level of support for pregnant employees and their managers. Tommy&#39;s is a charity that provides accredited, midwife-led pregnancy health information for parents-to-be, and funds research into the causes of pregnancy loss. It also provides evidence-based, expert and user-led, accessible pregnancy information to support expectant parents in understanding what they can do to support a safe and healthy pregnancy. https://www.tommys.org</p>","lastModified":"2018-10-05T23:04:29+0000","slices":[]}}}
