{"path":"company-policies/quality-management-statement","templateID":0,"sharedPropsHashes":{"menuItems":"Z12oxBx"},"localProps":{"page":{"id":"XinNxRIAACEAZq9N","type":"page","slug":"company-policies/quality-management-statement","title":"Quality management statement (ISO9001)","content":"<h1>Quality management statement.</h1><p>This Quality Policy Statement outlines our endorsement and approach to Quality at Deeson Group Limited and intends to communicate to all personnel the overall aim of our BS EN ISO 9001:2015 Quality Management System. Its purpose is to communicate the company’s expectations to all those delivering services on our behalf.</p><p>Commitment to quality is vital for our long-term success. We must listen to our clients, understand and manage their needs and expectations, endeavouring to achieve complete satisfaction by getting things right first time so they are totally satisfied by their experience with Deeson. For us the term ‘Quality’ isn’t just about the quality of the work that we create for the client, but also the overall quality of service that we provide.</p><p>MISSION STATEMENT: - The directors and staff of the Deeson Group Limited will constantly strive to achieve a profitable company by:</p><ul><li>Providing our clients with the best possible standards of service and quality of work; </li><li>Creating a happy and friendly environment in which to work; and</li><li>Providing a continuous commitment to training and improving standards </li></ul><p>In order to verify that we are achieving overall client satisfaction, we must listen to their comments, taking note of any opportunities for improvement.</p><p>To help us manage quality at Deeson, our procedures are structured to comply with the requirements of the internationally recognised standard ISO 9001. A central part of this is that we understand our business risks and define objectives (targets) which help us to continually improve the effectiveness and suitability of our operations and service to our clients. To achieve these business development goals, every member of staff needs to understand their responsibilities and how their role affects the end client.</p><p>We have prepared this statement as our commitment to quality management. This message shall be communicated and understood throughout the company and we expect that all persons carrying out work upon our behalf share these values.</p><p>Simon Wakeman</p><p>Managing Director</p>","lastModified":"2020-01-23T16:47:17+0000","slices":[]}}}
