{"path":"company-policies/mental-health-policy","templateID":0,"sharedPropsHashes":{"menuItems":"Gbcro"},"localProps":{"page":{"id":"X0Tw6hAAACEAKEKx","type":"page","slug":"company-policies/mental-health-policy","title":"Mental health policy","content":"<h1>Mental Health Policy</h1><h2>Purpose</h2><p>The purpose of this policy is for Deeson to establish, promote and maintain the mental health and wellbeing of all staff through workplace practices, and encourage staff to take responsibility for their own mental health and wellbeing.</p><p>Deeson believes that the mental health and wellbeing of our staff is key to organisational success and sustainability.</p><h4>Goals</h4><ul><li>To build and maintain a workplace environment and culture that supports mental health and wellbeing and prevents discrimination (including bullying and harassment). </li><li>To increase employee knowledge and awareness of mental health and wellbeing issues and behaviours. </li><li>To reduce stigma around depression and anxiety in the workplace.</li><li>To facilitate employees active participation in a range of initiatives that support mental health and wellbeing. </li></ul><h4>Scope</h4><p>This policy applies to all employees of Deeson.</p><h4>What are mental health issues?</h4><p>Mental health issues in the workplace are any condition that affect employees&#39; state of mind. These conditions may include depression, stress and severe anxiety which may result in burnout, ill-health or nervous breakdowns. </p><p>Mental health problems manifest in different ways. Some employees may suffer with no physical side effects, while others may experience physical symptoms (e.g. increased blood pressure, migraines, tummy problems, lethargy, insomnia, changes in eating habits.)</p><h4>Factors that cause mental health issues</h4><p>Employees may experience mental health issues for various reasons that an employer cannot control (e.g. hereditary, family conflicts, general health.) But, there are also work-related reasons for mental health problems, including:</p><ul><li>Excessive pressure.</li><li>Work-life imbalance.</li><li>Feeling devalued or under-appreciated by an employer.</li><li>Unsatisfactory job or workload.</li><li>Sustained isolation as a result of Covid-19.</li></ul><p>To every extent possible, our company’s leaders aim to recognise and address cases of workplace pressures that contribute to mental health issues.</p><h4>Company Actions</h4><p>We aim to:</p><ul><li>Treat mental illness seriously.</li><li>Identify concerns proactively and provide a safe space for team members to seek support if desired.</li><li>Support employees who face mental health problems.</li><li>Create healthy, supportive and sustainable workplaces in collaboration with managers, employees, unions and health experts.</li></ul><p>As a way to create a safe and supportive space, we offer:</p><ul><li><a  href=\"https://handbook.deeson.co.uk/working-at-deeson/where-and-when-we-work/https://\">Flexible hours / work from home</a></li><li><a  href=\"https://handbook.deeson.co.uk/working-at-deeson/wellness/https://\">Wellness fund</a></li><li><a  href=\"https://deeson-handbook.cdn.prismic.io/deeson-handbook/2afe5c50-d87e-4852-83fa-2a00c56b5c6d_Employee+Assistance+Programme.pdf\">Employee Assistance Programme</a> offering counseling and a 24-hour hotline for personal crises</li><li>Fortnightly wellbeing meetings  </li><li><a  href=\"https://handbook.deeson.co.uk/mental-health/https://\">Qualified Mental Health First Aider’s</a> </li></ul><p>This list isn’t exhaustive. All of these policies aim to preserve a harmonious workplace where employees can enjoy their work and balance their jobs with their personal lives. All managers must ensure the company adheres to these policies.</p><p>Additionally, we encourage open communication between employees and managers. If employees have a work-related problem, they should speak to their managers. If employees have a non-work related problem they may also choose to speak to any member of the leadership team or one of our qualified mental health first aiders.  In some cases, the company may suggest or recommend provisions or work-place provisions to support the individual. </p><h4>Responsibility</h4><p>All employees are encouraged to:</p><ul><li>understand this policy and seek clarification from management as required</li><li>support and contribute to Deeson’s aim of providing a healthy and supportive environment for all team members</li></ul><p>Managers have a responsibility to:</p><ul><li>ensure that their direct reports are made aware of this policy</li><li>actively support and contribute to the implementation of this policy, including its goals</li></ul>","lastModified":"2020-08-25T16:45:37+0000","slices":[]}}}
