{"path":"company-policies/modern-slavery","templateID":0,"sharedPropsHashes":{},"localProps":{"page":{"id":"W7fuxxQAAC0AfnZ1","type":"page","slug":"company-policies/modern-slavery","title":"Modern slavery policy","content":"<h1>Modern slavery.</h1><p><em>This policy applies to Deeson Group Ltd and Deeson Publishing Ltd.</em></p><h2>Introduction.</h2><p>Modern slavery is a crime and a violation of fundamental human rights.</p><p>It takes various forms, such as slavery, servitude, forced and compulsory labour and human trafficking, all of which have in common, the deprivation of a person&#39;s liberty by another in order to exploit them for personal or commercial gain.</p><p>We are committed to improving our practices where necessary, to combat slavery and human trafficking.</p><p>This statement is made pursuant to section 54(1) of the Modern Slavery Act 2015 and constitutes The Deeson Group Ltd&#39;s and Deeson Publishing Ltd&#39;s (Deeson&#39;s) slavery and human trafficking statement for the current financial year.</p><h2>Organisational structure.</h2><p>Deeson is a provider of software development services in the IT and technology sector. Deeson also provides publishing services and activities.</p><h2>Our policies on slavery and human trafficking.</h2><p>We are committed to ensuring that there is no modern slavery or human trafficking in our supply chains or in any part of our business.</p><p>We have undertaken a risk analysis of our supply chain, to ensure that we comply with our commitments in this policy.</p><p>In light of the obligation to report on measures to ensure that all parts of our business and supply chain are slavery free, we have reviewed our workplace policies and procedures to assess their effectiveness in identifying and tackling modern slavery issues.</p><p>Our workplace policies and procedures demonstrate our commitment to acting ethically and with integrity in all our business relationships, and to implementing and enforcing effective systems and controls, to ensure slavery and human trafficking is not taking place anywhere in our supply chains.</p><h2>Due diligence processes for slavery and human trafficking.</h2><p>As part of our initiative to identify and mitigate risk we have in place systems to:</p><ul><li>Identify and assess potential risk areas in our supply chains.</li><li>Mitigate the risk of slavery and human trafficking occurring in our supply chains.</li><li>Monitor potential risk areas in our supply chains.</li><li>Protect whistle blowers.</li></ul><h2>Supplier adherence to our values.</h2><p>We have zero tolerance to slavery and human trafficking. To ensure all those in our supply chain and contractors comply with our values, we regularly audit suppliers to Deeson.</p><p>To ensure a high level of understanding of the risks of modern slavery and human trafficking in our supply chains and our business, we provide relevant training to staff involved in supply chain management.</p>","lastModified":"2018-10-05T23:08:38+0000"}}}
