{"path":"working-at-deeson/wellness","templateID":0,"sharedPropsHashes":{"menuItems":"Z2qbe7v"},"localProps":{"page":{"id":"W7flHBQAACsAfksX","type":"page","slug":"working-at-deeson/wellness","title":"Wellness fund","content":"<h1>Wellness fund.</h1><p><em>This information is for team members employed by Deeson Group Ltd and Deeson Publishing Ltd.</em></p><p>All permanent Deeson employees are entitled to an annual personal £250 <a  href=\"https://www.deeson.co.uk/blog/healthy-mind-healthy-body-new-deeson-wellness-fund\">wellness fund</a>, which they can spend on improving their health and wellbeing.</p><p>During the Coronavirus (COVID-19) pandemic staff can purchase wellness equipment and products to use.</p><h2>Two simple guidelines.</h2><ul><li>It should be used on something which you&#39;re not already doing.</li><li>It should be used on activities you spend time doing, rather than the equipment you&#39;ll be doing it with.</li></ul><h2>Inspiration Ideas during COVID-19.</h2><ul><li>Vitamins, herbal supplements and health products </li><li>Aromatherapy products, humidifier </li><li>White noise machine, glow light to aid sleep</li><li>Sun lamp </li><li>Adult colouring book, paints etc</li><li>Equipment for learning a new skill; creative writing, knitting products</li><li>A weighted blanket, memory foam pillow </li><li>Face masks, bath salts, essential oils </li><li>Online wellness courses for stress management, meditation or spiritual</li><li>Online counselling and therapy sessions</li><li>Online yoga, exercise or dance class</li></ul><h2>How to spend your wellness fund.</h2><ul><li>Consult the inspiration list above and choose how you&#39;d like to spend your budget. If you&#39;re unsure whether it&#39;s an eligible activity, please check with your manager.</li><li>Pay using a company credit card and upload the receipt to Receipt Bank, or pay from your personal account and claim as a normal expense.</li><li>We are keeping a record of how the team makes use of the wellness fund, so please let Mel R know what you plan to do and when.</li><li>It would be great to share what you did and what benefits you felt, so please share a short write up with the team on Slack afterwards.</li></ul><h2>Small print.</h2><ul><li>The wellness fund is £250 per calendar year.</li><li>In a team member&#39;s first year with the company, the fund is available on a pro rata basis.</li></ul>","lastModified":"2020-05-04T15:54:26+0000","slices":[]}}}
