{"path":"working-at-deeson/remote-meetings","templateID":0,"sharedPropsHashes":{"menuItems":"Gbcro"},"localProps":{"page":{"id":"XdZ6MBIAAB4A_MnI","type":"page","slug":"working-at-deeson/remote-meetings","title":"Deeson’s guide to remote meetings","content":"<p>Our best practice guidelines for running remote meetings at Deeson</p><h2>Principles, the 3 B’s</h2><p></p><h3>Be seen and heard</h3><p>Other attendees can see and hear you clearly.</p><h3>Be considerate </h3><p>You’re mindful of not speaking over other people, you champion the experience for remote attendees and you arrive on time.</p><h3>Be present</h3><p>You’re not distracted by your devices, other work, or your surroundings. You’re giving the attendees, and meeting, your full attention.</p><h2>Prep before the call</h2><ul><li>Attend 2 minutes early so you’re ready to start the call promptly </li><li>Make sure you have a headset that limits background noise or you’re in a quiet place</li><li>If you’re in a room with other people, use a Jabra microphone instead of relying on laptop&#39;s microphone (and ensure this is set up in advance of the meeting start)</li><li>Snooze your Slack notifications before you join a Zoom call</li><li>Remove the temptation to do other work by minimising your other screens</li><li>Make sure you are sat somewhere that is quiet enough for you to hear and contribute to the meeting</li><li>Test all technology (including camera/video, Wi-Fi, and screen sharing) before the meeting</li></ul><h2>On the call</h2><ul><li>Wherever possible share your video </li><li>If you use multiple monitors, put your open Zoom call on the monitor with your camera so you can give eye contact</li><li>Mute when you’re not speaking </li><li>Ensure you are on gallery view so that you can see the face of everyone in the meeting</li><li>Do not use your phone during a meeting and make sure it’s on silent</li><li>DO NOT DO WORK WHILE ON A MEETING. You think it&#39;s not obvious, but it is! Feel free to call people out if you think this is happening in a meeting you’re in</li><li>If someone is doing a screen share presentation and you wish to speak, use the available Zoom features such as &#39;raise hand&#39; under the participants list view so the speaker knows to pause</li><li>Don’t interrupt people whilst they’re speaking </li><li>Ask participants to rate the meeting at the end of a call to capture timely feedback</li></ul><h2>If you’re the facilitator</h2><ul><li>Include a Zoom link in your meeting invite</li><li>If you know multiple people are joining the call, book a meeting room in advance </li><li>Make sure everyone joins individually via their laptop </li><li>Where some of the group attendees are co-located, please select a &#39;remote advocate&#39; who will ensure you have a room and the speaker is set up in advance of the meeting starting</li><li>Where some of the group are co-located, please ensure you still speak to your laptop, in proximity to the speaker, and avoid the temptation to address just those in the room with you</li></ul>","lastModified":"2019-12-09T15:43:43+0000","slices":[]}}}
