{"path":"working-at-deeson/remote-working","templateID":0,"sharedPropsHashes":{"menuItems":"2nsjHi"},"localProps":{"page":{"id":"XqlkgRIAACIAt-1_","type":"page","slug":"working-at-deeson/remote-working/","title":"Remote working: Protect your time & energy.","content":"<h3>Video Calls.</h3><p>Video calls require a complete focus on the screen. When you’re speaking, the attention is fully on you. You can’t naturally turn to the person next to you as you would in real life, nor can you make eye contact with someone for a silent connection or handover of the conversation. Video forces everyone into a single conversation, with no other forms of natural distraction, and this level of focus is tiring. </p><p>Add to the mix the lack of ‘real’ human contact and it is also emotionally taxing - dissonance is exhausting. You’re looking at people without making eye contact, you’re speaking but being heard a second late, you’re not together but tricked into thinking you are - you are in the constant presence of each other&#39;s absence!</p><p></p><h3>Recommendations.</h3><p></p><h4>Is a video call always necessary? </h4><p>Due to the handy /zoom feature in slack, it feels super quick and convenient to “jump on a zoom call”. In reality, ‘jumping’ on a Zoom call is seldom that quick, and requires a certain level of energy. It also demands immediacy from all parties.</p><p>Before asking a team member to jump on a Zoom call, think about how relevant it is that you speak to them face-to-face about this issue. Could you ask them the question on slack so they can get back to you when they’re free? Could you use the google doc in question to tag a comment? Do you already have a meeting with them later that day, to which you can add 5 mins to the start / end of?</p><p></p><h4>The dog and bone</h4><p>Videos are important for meetings, but if you need a quick 1-1, why not do a phone call. This option allows you to step away from your desk and have a short focused call, without the energy of a video. It gives you an opportunity to stretch your legs, or step into the sunshine, just as you would in the office when you pop over to someone’s desk, grab a coffee together, or move to a meeting room.</p><p>Slack has an audio dial function, so you don’t even need to be swapping phone numbers if you don’t want to!</p><p></p><h4>How long is a piece of Zoom?</h4><p>When you set up a meeting in google, what is your default duration? Be mindful of the time you block into people’s diaries - unless you think the meeting really demands 60 minutes (they rarely do) then please don’t just block an hour to diaries and “finish early”. This not only misleadingly blocks team diaries and available time, but it also invites longer, less concise meetings. </p><p>If you are well prepared for your meeting, client or internal, you should have a clear idea of what needs to be covered and achieved. Have an agenda and stick to it - this will lead to efficient and concise calls which can be wrapped in 30 minutes.</p><p></p><h4>Are you needed?</h4><p>Have you ever sat on a call and thought, ‘I’m not sure why I’m here’? If so, you probably don’t need to be on it! If this is a recurring meeting, establish from the person who invited you why they have. If it’s for information only, then perhaps a post-meeting channel summary is enough - resulting in a one minute read, and not a 30 minute call. Don’t rely on either people to protect your time, you know your priorities best!</p><p></p><h3>Slack.</h3><p></p><p>According to a Microsoft report, after being interrupted it takes about 25 minutes to get back to the task you were working on. It can take even longer to get into deep work, or a “flow state”; the concentrated frame of mind you’re in when immersed in a task and time flies by. It’s also when you do your best work.</p><p>By its very nature, Slack demands immediate response - keeping up with Slack conversations can feel like a full-time job. Slack goes from helping you work remotely to making it impossible to get work done! And not getting enough done during the day pushes work into your own time which will inevitably interrupt your work-life balance, or create a level of stress</p><h3>Recommendations.</h3><p></p><h4>All channel messages</h4><p>There are times when it&#39;s entirely appropriate to send a message and notify the whole channel. Those times, however, are rare, and usually it&#39;s better to post your message and tag the relevant people. Unless you have an urgent message that absolutely requires the attention of everyone in a channel, use @channel and @here sparingly. [Also, know the difference! @channel notifies everyone in that channel regardless of status, @here only notifies anyone online at that time.]</p><p></p><h4>Put it in a thread</h4><p>If you are responding directly to a post please reply in a thread so as to avoid multiple posts on the same topic clogging up the channel.</p><p></p><h4>Acknowledging messages</h4><p>It&#39;s totally reasonable to want a little peace and quiet from the constant stream of Slack notifications. If someone sends you a message, especially a DM, that requires more than a quick ‘yes/no’ then feel free to acknowledge the message and let them know you’ll come back to them by XX. You can then use a slack reminder so you remember to return to it.</p><p></p><h4>Snooze your slack</h4><p>For deep working, it’s important to set the right environment for yourself. Other people can’t be responsible for your flow state. If all they can see of you is a green ‘available’ dot then they’ll assume that you’re available! Use the do not disturb setting on your slack accordingly to give yourself a couple of distraction free hours. People can still message you, but they won’t expect an immediate response and you won’t get notified / disturbed.</p><p></p><h4>Sidebar settings</h4><p>Change sidebar settings so that you only see starred channels and unread messages. Once your most important and regular channels are starred, you can remove all other unnecessary conversations from your sidebar. (Preferences &gt; Sidebar &gt; Unreads and starred conversations)</p><p></p><h4>Do it yourself</h4><p>Due to the ‘quick and easy’ nature of slack, it can be tempting to ask questions that with a little bit of time, you can probably answer for yourself. For example, all gmail diaries are default to open, so you can find team availability this way. Equally, if you need to find a document please do your own searches on the shared drive, and in slack channels, before asking the channel and/or your manager.</p><p></p><h4>Emojis are fun-ctional</h4><p>Reducing the noise in public Slack channels is everyone’s responsibility. And just like you hate when people use “reply all” on emails, you don’t need to respond to every message that’s said!  A good alternative is to use emojis to respond. You can ask for specific emojis to signify a positive or negative reaction, or to create a poll. This is a low-friction way to give acknowledgement (so the person writing doesn’t have to follow up) and to show your response without clogging up the channel. </p><p>Be creative!</p><p></p>","lastModified":"2020-04-29T11:32:38+0000","slices":[]}}}
