{"path":"company-policies/environmental-policy","templateID":0,"sharedPropsHashes":{"menuItems":"ZaBhI2"},"localProps":{"page":{"id":"W7ftqBQAACoAfnFi","type":"page","slug":"company-policies/environmental-policy","title":"Environmental policy","content":"<h1>Environmental policy.</h1><p><em>This policy applies to Deeson Group Ltd and Deeson Publishing Ltd. Reviewed June 2019.</em></p><p>Deeson is an enthusiastic supporter of environmental policies, not only because we recognise they are essential to the future wellbeing of the world but because they invariably ensure good housekeeping and help to improve our profits. We conform with environmental regulations, laws and codes of best practice.</p><p>Our procurement and policy adherence processes are verified through our ISO9001 accreditation.</p><h2>Responsibility.</h2><p>Our Managing Director is responsible for ensuring that the environmental policy is implemented. However, all Deeson employees have a responsibility in their area to ensure that the aims and objectives of the policy are met.</p><h2>Policy aims.</h2><p>As a business which takes its environmental and social responsibilities very seriously, we will:</p><ul><li>Comply with and exceed all relevant regulatory requirements.</li><li>Continually improve and monitor environmental performance.</li><li>Continually improve and reduce environmental impacts.</li><li>Incorporate environmental factors into business decisions.</li><li>Increase employee awareness and training on environmental issues.</li></ul><h2>Paper.</h2><ul><li>We will minimise the use of paper in the office and only print information where it is absolutely necessary.</li><li>All internal communications and filing is electronic.</li><li>We will reduce packaging as much as possible and make purchase decisions with this in mind.</li><li>We buy recycled and recyclable paper products.</li><li>We will reuse and recycle all paper where possible.</li></ul><h2>Energy and water.</h2><ul><li>We will seek to reduce the amount of energy used as much as possible in our operations.</li><li>Lights and electrical equipment are switched off when not in use.</li><li>Heating is adjusted with energy consumption in mind and uses a Nest thermostat to enable intelligent scheduling and remote deactivation of office heating.</li><li>The energy consumption and efficiency of new products will be taken into account when purchasing.</li></ul><h2>Office supplies.</h2><ul><li>We evaluate if the need for a product or service can be met in another way.</li><li>We evaluate if renting/sharing is an option before purchasing equipment.</li><li>We evaluate the environmental impact of any new products we intend to purchase.</li><li>We favour more environmentally friendly and efficient products wherever possible.</li><li>We reuse and recycle everything we are able to.</li></ul><h2>Transportation.</h2><ul><li>We reduce the need to travel, restricting to necessity trips only.</li><li>Where travel is unavoidable we prefer the use of public transport. More than 90% of our business journeys are made using public transport. Our Canterbury office is less than ten minutes&#39; walk from two mainline railway stations and our Shoreditch office is a two minute walk from public transport.</li><li>We promote the use of travel alternatives such as video/phone conferencing.</li><li>We will make additional efforts to accommodate the needs of those using public transport or bicycles including provision of bike parking, showers and storage.</li><li>We will favour ‘green’ vehicles and maintain them rigorously to ensure ongoing efficiency.</li></ul><h2>Maintenance and cleaning.</h2><ul><li>Cleaning materials used will be as environmentally friendly as possible.</li><li>Materials used in office refurbishment will be as environmentally friendly as possible.</li><li>All paper waste is recycled, and the staff are actively encouraged to recycle plastic and metal waste. </li><li>General waste and recyclable waste bins are located on all floors of the building and the contents are disposed of in two separated dumpsters, for weekly collection by an accredited waste processor.</li></ul><h2>Monitoring and improvement.</h2><ul><li>We comply with and exceed all relevant regulatory requirements.</li><li>We continually improve and monitor environmental performance.</li><li>We continually improve and reduce environmental impacts.</li><li>We incorporate environmental factors into business decisions.</li><li>We increase employee awareness through training.</li><li>We review this policy and any related business issues at our monthly management meetings.</li></ul><h2>Culture.</h2><ul><li>We involve staff in the implementation of this policy, for greater commitment and improved performance.</li><li>We update this policy at least once annually in consultation with staff and other stakeholders where necessary.</li><li>We provide staff with relevant environmental training.</li><li>We work with suppliers, contractors and sub-contractors to improve their environmental performance.</li><li>We use local labour and materials where available to reduce CO2 and help the community.</li></ul><h2></h2>","lastModified":"2019-07-15T08:42:24+0000"}}}
