{"path":"company-policies/environmental-policy","templateID":0,"sharedPropsHashes":{"menuItems":"ZaBhI2"},"localProps":{"page":{"id":"W7ftqBQAACoAfnFi","type":"page","slug":"company-policies/environmental-policy","title":"Environmental policy","content":"<h1>Environmental policy.</h1><p><em>This policy applies to Deeson Group Ltd and Deeson Publishing Ltd.</em></p><p>Deeson is an enthusiastic supporter of environmental policies, not only because we recognise they are essential to the future wellbeing of the world but because they invariably ensure good housekeeping and help to improve our profits. We conform with environmental regulations, laws and codes of best practice.</p><p>Our procurement and policy adherence processes are verified through our ISO9001 accreditation.</p><h2>Recycling and reducing waste.</h2><p>The business is computer-driven, and our IT department has transferred all possible administrative and accountancy systems to computers, thus saving considerable amounts of paper. Communications with suppliers are by digital means whenever possible. Invoicing is entirely electronic.</p><p>All staff, whatever their role, have computers on their desks and internal company information is conveyed electronically.</p><p>Staff are encouraged to minimise the use of desktop printers and we continue to reduce their availability in line with managed demand. Used ink/toner cartridges are recycled.</p><p>All paper waste is recycled, and the staff are actively encouraged to recycle plastic and metal waste. General waste and recyclable waste bins are located on all floors of the building and the contents are disposed of in two separated dumpsters, for weekly collection by an accredited waste processor.</p><h2>Energy saving.</h2><p>Throughout the building, lighting is supplied by fluorescent tubes and energy-efficient fittings. Staff are encouraged to switch off lights when rooms are empty and to put computers to sleep/turn off monitors.</p><p>In December 2012, a new energy-efficient gas-fired central heating boiler was installed and is operated by a thermostat and timer. The hot water immersion tank is fitted with a timer.</p><h2>Transport.</h2><p>We encourage staff to use public transport whenever possible; more than 90% of our business journeys are made using public transport. Our offices are ten minutes&#39; walk from two mainline railway stations.</p><p>We are active participants in a cycle to work scheme – www.cyclescheme.co.uk</p><h2>Suppliers.</h2><p>Our main suppliers of physical materials are printers. We insist that our products are printed on paper recycled from waste or, if this is not practical, on paper made from sustainable and renewable forest resources.</p><h2>Commitment.</h2><p>Directors and staff are fully committed to this environmental policy, which we regard as ongoing and which is reviewed annually.</p>","lastModified":"2018-10-05T23:03:11+0000"}}}
