{"path":"working-at-deeson/taking-leave","templateID":0,"sharedPropsHashes":{},"localProps":{"page":{"id":"W7fk6BQAAC0Afkov","type":"page","slug":"working-at-deeson/taking-leave","title":"Holidays and time off","content":"<h1>Holidays, emergencies, sick leave and compassionate leave.</h1><h2>Holidays.</h2><p>There are 24 days of paid leave per calendar year, plus UK bank holidays.</p><p>For team members based outside the UK, there may be individual variations to this based on local public holidays.</p><p>You have to take time off from your allowance each year for our Christmas to New Year company-wide close down period. This is usually three or four days of leave and will be automatically booked for you at the start of each calendar year.</p><h2>How to book time off.</h2><p>It’s each team member’s responsibility to plan their own holiday to fit in with their project commitments (as shown in Forecast). Given that we usually plan our projects some months in advance, this will mean thinking ahead.</p><p>Here are the steps you need to take to book holiday:</p><ol><li>Review your own project commitments in Forecast and understand how you’ll fulfil any booked project commitments, alongside the holiday you want to take.</li><li>Add the holiday to Forecast, so it’s clear to everyone else that time is potentially going to be taken as holiday.</li><li>Talk this through with the Project Lead/s, as well as team members as necessary, for any projects that you’re working on at the time you want to take off.</li><li>Submit your request and add any notes about projects affected/what you’ve agreed with the Project Leads via Bamboo.</li><li>Your line manager will review and then approve/decline the request. If it isn’t approved, you then need to remove the holiday from Forecast.</li></ol><p>Remember, all leave needs to be taken by the end of the calendar year. Leave can only be rolled over in exceptional circumstances, with MD approval in advance.</p><p>You can check your balance using Bamboo. Remember to use the date calculator and set the date to 31st December to view your balance for the whole year, including days booked but not yet taken.</p><p>You can book time off in half days (3.5 hours) or whole days (seven hours).</p><h2>Time off for emergencies.</h2><p>As an employer, we want to be as flexible as possible for the unexpected and unpredictable things that happen in life. For emergency or short notice situations, such as a family member falling ill during the day, Chapter Leads/Directors can exercise flexibility in allowing you to take up to half a day (3.5 hours) off and then making up the hours at another time that suits the needs of the project.</p><p>Anything more than half a day (3.5 hours), and for all other situations, e.g. longer-term illness, medical appointments for children etc, it is reasonable that this is taken as leave.</p><p>As always, the accountability is the team member’s in ensuring that the impact of this (e.g. on project delivery and other team members) is managed and quality standards are maintained.</p><p>Every situation is different, so we’ll always happy to discuss your specific situations as and when they occur.</p><h2>Sickness and medical appointments.</h2><p>These should be incorporated into your flexible time wherever possible, otherwise requested via Bamboo.</p><p>If you&#39;re sick, the company provides ten paid sick days per calendar year. You should speak to your Chapter Lead as soon possible each day, to let them know you are unwell and to hand over any work that needs dealing with that day.</p><h2>Compassionate leave.</h2><p>We offer compassionate leave where your personal circumstances mean it isn&#39;t possible for you to work.</p><p>Due to the sensitive nature of these situations, we don’t have a blanket policy about how compassionate leave is agreed.</p><p>If you feel you need to take compassionate leave, please discuss with your line manager in confidence.</p><p><em>This information is for team members employed by Deeson Group Ltd and Deeson Publishing Ltd.</em></p>","lastModified":"2018-10-05T22:25:53+0000"}}}
