{"path":"working-at-deeson/joining-deeson","templateID":0,"sharedPropsHashes":{},"localProps":{"page":{"id":"W7fkZBQAACsAfkfd","type":"page","slug":"working-at-deeson/joining-deeson","title":"Onboarding","content":"<h1>Onboarding.</h1><p>It’s really important that we support new team members in their transition to being a member of the Deeson team.</p><p>We want new team members to be happy, engaged and effective as soon as possible.</p><p>This section of our handbook explains what we do to support new team members, from the day they sign their Deeson contract, through to the end of their first year with the company.</p><p>Like all our processes, onboarding is something we review regularly to make sure it’s doing the job that we need it to.</p><h2>Accountability.</h2><p>As a new team member, you are accountable for your own onboarding.</p><p>You’ll find that everyone in the agency will be able to help you out and point you in the right direction. In particular, your Chapter Lead is accountable for ensuring your successful transition and will be there to work with you where needed.</p><p>This section of our Handbook sets out the expectations that we have for the successful onboarding of new team members joining the agency.</p><p>Everyone is different, so each person’s induction will happen differently but our expectations about the outcomes are the same.</p><h2>A successful first six months.</h2><p>Over time we expect all our team members to be self-led and be able to work effectively as part of our self-organising project teams.</p><p>But we understand that the way we do things might be different to what you’ve experienced elsewhere.</p><p>That’s why we have a specific approach to ensuring you have a successful first six months at Deeson.</p><p>It’s a focused period when you’ll be doing a lot of learning – about Deeson, our team members, how we do things and about your role.</p><p>Successfully completing your first six months is a milestone in your work with Deeson and is a great achievement.</p><p>Your Project Leads, Chapter Lead and fellow team members are there to support and help you to successfully complete your first year.</p><h2>Before you start.</h2><p>Onboarding begins once you’ve signed your contract and have an agreed start date.</p><p>The things you&#39;ll need to understand then are:</p><ol><li>The arrangements for your first day (where to be, when, how to get there).</li><li>Travel and accommodation arrangements in place for your first few on-site days (applies to distributed team members only).</li></ol><p>You&#39;ll receive a digital new starter pack from us, which explains more about what you need to do before you start and what you need to bring in on your first day.</p><p>Melanie Richards can help with bookings and advice for travel and accommodation.</p><p>We&#39;ll ensure your IT equipment is set up ready for your first day at work. We&#39;ll also make sure you have access fobs and keys for the Deeson offices.</p><h2>On your first day.</h2><p>We know that there’s a lot to take in on your first day in a new job. We’ll introduce you to lots of people but we don’t expect you to remember everyone’s name!</p><p>The outcomes for your first day at Deeson are shown below:</p><ol><li>You’ll have been shown around your main office.</li><li>You’ll know where your desk is and where you can hotdesk in the office.</li><li>You’ll have your laptop up and running, with the core business systems set up and working properly (Google Apps, Slack, Harvest, Forecast etc.</li><li>You’ll have had a coffee or lunch with some colleagues.</li><li>You’ll have completed the new joiner paperwork and provided the proof of a right to work in the UK.</li><li>You’ll have been introduced to the Deeson Handbook and will have begun reading it.</li></ol><h2>In your first week.</h2><p>Having made it through your first day, your first week is about getting to know the way we do things, meeting more people and getting started in your role.</p><p>The outcomes for your first week at Deeson are shown below:</p><ol><li>You’ll have consulted with a Chapter colleague to make sure you have everything installed on your machine to do your job. We have a standard suite of tools for each specialist role in the agency.</li><li>You’ll have met the Managing Director.</li><li>You’ll have met with your Chapter Lead.</li><li>You’ll have read and understood our company policies.</li><li>You’ll have agreed month one goals with your Chapter Lead, to help inform your learning during your first month. We have a self-led development approach. This is your first step towards self-led development.</li><li>You’ll have a first week review meeting with your Chapter Lead. This is an opportunity to share feedback from your first week and ask those burning questions.</li></ol><p><em>This information is for team members employed by Deeson Group Ltd.</em></p>","lastModified":"2018-10-05T22:23:35+0000"}}}
