{"path":"working-at-deeson/pdp","templateID":0,"sharedPropsHashes":{"menuItems":"2n0Nyl"},"localProps":{"page":{"id":"W7fpIhQAACwAfl0L","type":"page","slug":"working-at-deeson/pdp","title":"Professional development plan (PDP)","content":"<h1>Professional development plan.</h1><p>We strongly believe that professional development is vital to the future success of our team members and in turn, the business.</p><p>That&#39;s why every Deeson team member has a professional development plan (PDP) that they agree each year with their line manager.</p><h2>What PDP is and isn’t.</h2><p>Personal development is the time, space and support to help you develop skills applicable to your job. In turn, this helps team members grow as professionals and be better placed to carry out their <a  href=\"https://handbook.deeson.co.uk/handbook/roles-at-deeson/\">roles</a> within the agency.</p><p>The PDP process helps team members:</p><ul><li>Understand the direction the agency is heading, and their role in that.</li><li>Better understand which areas they should focus on improving.</li><li>Plan out potential development activities.</li><li>Agree on a development plan, including any time, budget or support required.</li></ul><p>The PDP process is not designed:</p><ul><li>To be done for team members. We will support them in creating and investing in their personal development, but it is theirs to own.</li><li>To be a one-off. Once we’ve created a plan, we’ll follow up regularly and review the overall plan as required.</li><li>To be a formal appraisal.</li></ul><h2>Pre-PDP briefing.</h2><p>Each team member has a briefing before their PDP session. In this briefing, the line manager talks through the latest company vision and strategy, as well as revisiting the job scorecard for the team member&#39;s role.</p><p>They also explain the PDP process and how the PDP workshop itself will work. The briefing happens one to two weeks before the PDP workshop, to allow the team member time to prepare properly.</p><h2>PDP workshop.</h2><p>In the individual PDP workshop, we use a variety of planning, visioning and reflective techniques to help each team member develop a plan that&#39;s right for them and their role.</p><p>The workshop usually lasts between one and two hours.</p><h2>After the PDP workshop.</h2><p>Once the workshop is finished, the team member writes up their PDP in a dedicated Trello board. This is then shared company-wide to help team members support each other in achieving their development goals.</p><p>The company supports professional development in many ways, including access to an unlimited training budget.</p><p>PDPs are reviewed regularly in one-to-one meetings, to make sure that team members are on track to achieve their plans.</p><p><em>This information is for team members employed by Deeson Group Ltd.</em></p>","lastModified":"2018-10-05T22:43:51+0000","slices":[]}}}
