{"path":"company-policies/health-and-safety-policy","templateID":0,"sharedPropsHashes":{"menuItems":"ZQBmeK"},"localProps":{"page":{"id":"W7ftgxQAACsAfnC8","type":"page","slug":"company-policies/health-and-safety-policy","title":"Health and safety policy","content":"<h1>Health and safety policy.</h1><p><em>This policy applies to team members employed by Deeson Group Ltd and Deeson Publishing Ltd.</em></p><p>The company believes in the active prevention of accidents and ill health, and it is its policy to ensure, so far as is reasonably practicable, the health, safety and welfare of its employees. The company will, to this end, endeavour to keep up-to-date with current professional expertise on health and safety matters, and to observe all relevant statutes, regulations and codes of practice.</p><p>The company recognises its duties to persons other than employees and it is its policy to ensure, so far as is reasonably practicable, that the health and safety of visitors is not put at risk by its operations. Particular attention is paid to the provision and maintenance of:</p><ul><li>Plant, equipment and systems of work that are safe and without risk.</li><li>Sufficient information to enable all employees to avoid hazards and contribute positively to their own health and safety at work.</li><li>A working environment which is safe and without risk to health, and with safe access to and exit from it.</li></ul><p>The company reminds its employees of their own duties, under Section 7 of the Health and Safety at Work etc Act 1974, to take care of their own health and safety and that of other persons who may be affected by acts or omissions at work, and to co-operate with the company in meeting its responsibilities.</p><p>The premises are inspected regularly. All passages and gangways should be kept clear of obstructions, including trailing wires. All electric cables should be checked from time-to-time to ensure they are safe. Care should be taken on all staircases, especially those to the top floor, which are very steep.</p><p>Never lift beyond your capability and avoid strains.</p><h2>Additional points.</h2><ul><li>Do not attempt to repair anything that is electrically powered yourself.</li><li>Report non-repairable faults to your line manager and put a notice on the machine to say that it is out of order – especially if you have received an electric shock from it or it is overheating.</li><li>Do not overload electrical sockets.</li><li>Report any frayed wires or damaged sockets, switches, plugs and fittings.</li><li>If you are under 18, by law you are not allowed to clean any office machinery that might expose you to the risk of injury.</li><li>You may not work above ground level or use steps etc unless you are specifically authorised to do so.</li><li>The lights on the staircases and in passageways must be left on in order to provide sufficient light for safe movement. If you use a screen, report any eye problems promptly to your line manager.</li><li>Curtains/blinds should be drawn when appropriate.</li><li>Avoid artificial light shining on your screen.</li><li>Make sure you are sitting comfortably and your back is properly supported.</li></ul><h2>Review.</h2><p>The effectiveness of this policy and associated arrangements will be reviewed annually under the direct supervision of the Managing Director.</p><p>Date of this issue: February 2005; Revised May 2005; Revised July 2005; Revised September 2005; Revised June 2006; Revised December 2006. Reviewed March 2013. Reviewed January 2015. Reviewed January 2017.</p>","lastModified":"2018-10-05T23:02:30+0000"}}}
