{"path":"business-continuity-Coronavirus","templateID":0,"sharedPropsHashes":{"menuItems":"2nsjHi"},"localProps":{"page":{"id":"XleAQRIAACcACkfO","type":"page","slug":"business-continuity-Coronavirus","title":"Business continuity - Coronavirus (COVID-19)","content":"<h1>Business continuity - Coronavirus (COVID-19)</h1><p><em>Last update 2nd March 1.59pm</em></p><p>Coronavirus (COVID-19) is a new strain of coronavirus first identified in Wuhan City, China in December 2019. You can read the latest about the UK government’s response to this virus here: <a  href=\"https://www.gov.uk/guidance/wuhan-novel-coronavirus-information-for-the-public\">https://www.gov.uk/guidance/wuhan-novel-coronavirus-information-for-the-public</a>.</p><p>Under our ISO27001 preparations, we already have well-established business continuity arrangements that this document is based on. In summary, our ways of working are already designed to enable fully remote working for a sustained period of time - as all team members are able to work flexibly already.</p><p>We have prepared this information to help team members and clients prepare for any potential escalation of the current situation. Our focus is on the health and safety of our staff, their families and our clients, while maintaining business continuity as much as possible.</p><p>We have set out some additional measures that we are taking to ensure preparedness and clarify how decisions will be made in the event of any escalation of the situation.</p><p>This is a rapidly evolving situation, so we will review this guidance each day and update it as necessary. If you have any questions at all relating to this, please speak with your line manager or the CEO. </p><h2><strong>Team members </strong></h2><h3>Personal wellbeing</h3><p>We are providing anti-bacterial hand sanitiser in each office and we recommend each team member carries their own supplies.</p><p>The World Health Organisation has published <a  href=\"https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-publichttps://\">guidance</a> for how to best protect yourself against infection:</p><h4>Wash your hands frequently</h4><p>Regularly and thoroughly clean your hands with an alcohol-based hand rub or wash them with soap and water.</p><p><strong>Why?</strong> Washing your hands with soap and water or using alcohol-based hand rub kills viruses that may be on your hands.</p>\n    <p class=\" block-img\">\n      <img src=\"https://images.prismic.io/deeson-handbook/799a8a70-3be5-4b74-aae2-9d2b4873fc0b__111075919_cough_etiquette_640_3x-nc.png?auto=compress,format\" alt=\"Source: NHS\" copyright=\"\">\n    </p>\n  <h4>Maintain social distancing</h4><p>Maintain at least 1 metre (3 feet) distance between yourself and anyone who is coughing or sneezing.</p><p><strong>Why?</strong> When someone coughs or sneezes they spray small liquid droplets from their nose or mouth which may contain virus. If you are too close, you can breathe in the droplets, including the COVID-19 virus if the person coughing has the disease.</p><h4>Avoid touching eyes, nose and mouth</h4><p><strong>Why? </strong>Hands touch many surfaces and can pick up viruses. Once contaminated, hands can transfer the virus to your eyes, nose or mouth. From there, the virus can enter your body and can make you sick.</p><h4>Practice respiratory hygiene</h4><p>Make sure you, and the people around you, follow good respiratory hygiene. This means covering your mouth and nose with your bent elbow or tissue when you cough or sneeze. Then dispose of the used tissue immediately.</p><p><strong>Why?</strong> Droplets spread virus. By following good respiratory hygiene you protect the people around you from viruses such as cold, flu and COVID-19.</p><h4>If you have fever, cough and difficulty breathing, seek medical care early</h4><p>Stay home if you feel unwell. If you have a fever, cough and difficulty breathing, seek medical attention and call in advance. Follow the directions of your local health authority.</p><p><strong>Why?</strong> National and local authorities will have the most up to date information on the situation in your area. Calling in advance will allow your health care provider to quickly direct you to the right health facility. This will also protect you and help prevent spread of viruses and other infections.</p><h3>Personal preparedness</h3><p>All team members should be prepared for the closure of one or both Deeson offices with no notice. This means ensuring they have the equipment (laptop, charger, back-up disc etc) to work from home for at least two weeks with them. In practice, this means no such equipment should be left in either Deeson office from now on.</p><p>Team members should ensure that their home working arrangements are fully functional to enable them to work from home effectively (internet access, working environment, VPN access etc). All team members have verified that they have checked their home working arrangements are effective for this purpose.</p><p>If you are travelling away from home for more than a day, you should take this equipment with you in the unlikely event of you being unable to return home due to government-enforced travel restrictions.</p><p>If we have to close one or more Deeson offices, this decision will be taken by the Managing Director and communicated to all staff on the #things-to-know Slack channel. Line managers will be responsible for ensuring all team members are aware of this decision being made.</p><h3>Travel<strong> </strong></h3><p>All team members should ensure they are aware of the government’s latest advice relating to travel and Coronavirus. If you have been to any areas affected by Coronavirus as listed on the government website you should follow the official advice and make your line manager aware of this: <a  href=\"https://www.gov.uk/guidance/wuhan-novel-coronavirus-information-for-the-public\">https://www.gov.uk/guidance/wuhan-novel-coronavirus-information-for-the-public</a>.</p><p>We will be pragmatic in the event of a team member needing to self-isolate due to Coronavirus and will support team members on a case-by-case basis if this happens.</p><p>All business travel outside the UK should be discussed and agreed with the leadership team before bookings are made until further notice.</p><h3>Sickness</h3><p>If you feel ill - whether related to Coronavirus or not - please stay at home. </p><p>Coming into the office risks spreading germs among the team. If you feel well enough to work, please work from home. If you don’t, you need to go off sick.</p><p>Normal processes for sickness reporting, pay and management continue to apply - full details here: <a  href=\"https://handbook.deeson.co.uk/company-policies/sickness-absence-policy/\">https://handbook.deeson.co.uk/company-policies/sickness-absence-policy/</a>.</p><h2><strong>Clients and projects</strong></h2><p>We will continue to deliver client projects as normal. </p><p>However, we’ve identified five circumstances where this may not be possible and so will have to make changes to minimise the impact on project delivery:</p><h3>a) Closure of Deeson offices</h3><p>We will move to full home working and project delivery will continue as normal.</p><h3>b) Closure of client sites</h3><p>We will work with each client to understand their contingency plans in relation to Coronavirus. Specifically, we will work with our day-to-day contacts to ensure that they would be able to continue working with us in the event that they were unable to access their normal place of work. </p><p>For clients for whom we are doing active projects during the next eight weeks, we will undertake business continuity tests with them to ensure they are able to adequately access Zoom and other systems from their alternative workplaces (home, other offices etc).</p><h3>c) Travel restrictions restricting face to face working </h3><p>We are undertaking a rolling two-week forward review of all planned on-site activities to identify how these could be run remotely should it be necessary to restrict travel or in the event of client site closure. Specific contingency plans for each planned on-site activity are <a  href=\"https://docs.google.com/spreadsheets/d/1kPwCD33iTOKcGmnyrMor55MjRb8x4TH4U736TOSZxN4/edit#gid=0\">here</a> (Deeson confidential).<br />Where necessary preparatory steps will be taken to enable these contingency arrangements to be put into place immediately. Such measures would be likely to include delivery of workshops over Zoom using remote collaboration tools. Planned workshops/interviews etc should only be cancelled as a last resort as this will have a knock-on effect on overall delivery plans.</p><h3>d) Higher than normal sickness among Deeson team members</h3><p>This might happen in extreme circumstances. We will be monitoring sickness levels each day. In the event of escalating sickness, the leadership team will review and make decisions on prioritisation of resources to maintaining client sites and project delivery as best we can.</p><h3>e) Client unavailable for extended period due to illness or inaccessible isolation </h3><p>We will plan with each of our clients for this situation and take prior mitigating steps that are specific to the type of work we are doing with them (foundations, build, ongoing support etc). Our priority will be to maintain delivery of client service as effectively as possible in these circumstances, while not compromising the quality of work we are doing and the overall project.</p><p></p>","lastModified":"2020-03-02T14:16:48+0000","slices":[]}}}
