{"path":"business-continuity-Coronavirus","templateID":0,"sharedPropsHashes":{"menuItems":"Gbcro"},"localProps":{"page":{"id":"XleAQRIAACcACkfO","type":"page","slug":"business-continuity-Coronavirus","title":"Business continuity - Coronavirus (COVID-19)","content":"<h1>Business continuity - Coronavirus (COVID-19)</h1><p><em>Last update 19th March 3.42pm</em></p><p>Coronavirus (COVID-19) is a new strain of coronavirus first identified in Wuhan City, China in December 2019. You can read the latest about the UK government’s response to this virus here: <a  href=\"https://www.gov.uk/guidance/wuhan-novel-coronavirus-information-for-the-public\">https://www.gov.uk/guidance/wuhan-novel-coronavirus-information-for-the-public</a>.</p><p>Under our ISO27001 preparations, we already have well-established business continuity arrangements that this document is based on. In summary, our ways of working are already designed to enable fully remote working for a sustained period of time - as all team members are able to work flexibly already.</p><p>We have prepared this information to help team members and clients prepare for any potential escalation of the current situation. Our focus is on the health and safety of our staff, their families and our clients, while maintaining business continuity as much as possible.</p><p>We have set out some additional measures that we are taking to ensure preparedness and clarify how decisions will be made in the event of any escalation of the situation.</p><p>This is a rapidly evolving situation, so we will review this guidance each day and update it as necessary. If you have any questions at all relating to this, please speak with your line manager or the CEO. </p><h2><strong>Working arrangements until further notice</strong></h2><p>We have reviewed our current advice to team members based on the latest information available from the UK government following the announcements on Monday, 17th March. </p><p>It’s important to emphasise that we are well set up for a change in how we work with minimal impact on our day-to-day activities. We have full home working systems and our delivery processes have been location-independent for many years. </p><p>These measures are intended to minimise risks for our team members and their families, as well as ensuring that we are responsible community members and minimising potential impacts on more vulnerable members of society.</p><p>In particular we are seeking to minimise the risks that are likely to be presented during from team members travelling on public transport, being in busy public spaces and attending public events and conferences.</p><p>From Wednesday, 10th March, the following arrangements will apply until further notice:</p><p><strong>Normal working location</strong>:</p><p>As an employer we are mandating that all team members work from home. We are fully set up for this and have already tested these arrangements with each team member.</p><p>The Canterbury and London offices are now closed. They can be used by prior arrangement only. If you need to use the office please speak with Sarah (London) or Simon (Canterbury) beforehand to ensure risks are managed and we follow government guidance.</p><p><strong>Internal meetings (Deeson, within group etc):</strong></p><p>All internal meetings should be held remotely using Zoom. There are now no exceptions to this.</p><p><strong>Internal events:</strong></p><p>All internal team events involving face to face presence are suspended. There will be no co-working in Canterbury on Mondays or London on Wednesdays. </p><p><strong>Client meetings and workshops:</strong></p><p>All client meetings and workshops should be held remotely using Zoom. There are now no exceptions to this.</p><p><strong>Public events eg conferences</strong>:</p><p>Deeson team members will not attend any public events, conferences or presentations until further notice.</p><p>No new bookings or commitments to future events should be made without a prior discussion with Sarah or Simon on the #biz-continuity channel </p><p><strong>Foreign travel</strong>:</p><p>Deeson team members will not undertake any work travel outside the UK  until further notice.</p><p>No new bookings or commitments to future travel should be made without a prior discussion with Sarah or Simon on the #biz-continuity channel </p><p><strong>Questions, concerns or clarifications?</strong></p><p>If you have any questions about this, please ask on the #biz-continuity Slack channel or speak with Sarah or Simon.</p><h2><strong>Team members </strong></h2><h3>School closures and caring responsibilities</h3><p>We appreciate that for some people the closure of schools and nurseries may mean that you need to be primary carer for your children during working hours for some periods. Normally this wouldn’t be possible as it’s hard to work effectively and care for children, especially young children, at the same time.</p><p>In understanding this, we have outlined some revised ways of working for those of you affected to help you balance work alongside carer responsibilities. By arrangement with your line manager only, we are happy to consider things like:</p><ul><li>Flexibility on core hours</li><li>Flexibility to spread your hours over a 7 day week</li><li>A focus on working billable hours only, for a short period of time</li></ul><p>If you’re working over a weekend it’s your responsibility to make sure you have enough work lined up and that you’re not blocked by anyone who is not online. Please also ensure you submit your timesheets on a Sunday if you’re working over the weekend.</p><p>If you have any caring responsibilities that you need flexibility to help with, please speak with your line manager to agree how we can be flexible in response to your specific circumstances. We’ll be making sure we’re supporting everyone as consistently and fairly as possible.</p><h3>Personal preparedness</h3><p>All team members should be prepared for the closure of one or both Deeson offices with no notice. This means ensuring they have the equipment (laptop, charger, back-up disc etc) to work from home indefinitely. In practice, this means no such equipment should be left in either Deeson office from now on.</p><p>Team members should ensure that their home working arrangements are fully functional to enable them to work from home effectively (internet access, working environment, VPN access etc). All team members have verified that they have checked their home working arrangements are effective for this purpose.</p><p>If you are travelling away from home for more than a day, you should take this equipment with you in the unlikely event of you being unable to return home due to government-enforced travel restrictions.</p><h3>Personal travel<strong> </strong></h3><p>All team members should ensure they are aware of the government’s latest advice relating to travel and Coronavirus. If you have been to any areas affected by Coronavirus as listed on the government website you should follow the official advice and make your line manager aware of this: <a  href=\"https://www.gov.uk/guidance/wuhan-novel-coronavirus-information-for-the-public\">https://www.gov.uk/guidance/wuhan-novel-coronavirus-information-for-the-public</a>.</p><p>We will be pragmatic in the event of a team member needing to self-isolate due to Coronavirus and will support team members on a case-by-case basis if this happens.</p><h3>Sickness</h3><p>If you feel ill and are unable to work - whether related to Coronavirus or not - please report this to your line manager as usual.</p><p>Normal processes for sickness reporting and management continue to apply - full details here: <a  href=\"https://handbook.deeson.co.uk/company-policies/sickness-absence-policy/\">https://handbook.deeson.co.uk/company-policies/sickness-absence-policy/</a>.</p><p>All Deeson staff contracts provide for 10 days sick leave on full pay each 52 weeks. </p><p>In light of COVID-19 current situation, we are going to provide all team members up to an additional 10 days of sick leave on top of the contractual entitlement. This is so you’re not disadvantaged should you become unwell and unable to work due to COVID-19 during. We will review again at the end of 2020 based on the circumstances at that time.</p><h2><strong>Clients and projects</strong></h2><p>We will continue to deliver client projects as normal. </p><p>However, we’ve identified five circumstances where this may not be possible and so will have to make changes to minimise the impact on project delivery:</p><h3>a) Closure of Deeson offices</h3><p>We will move to full home working and project delivery will continue as normal.</p><p><strong>Update 17/3/20: This has now occurred and we have implemented our business continuity plan.</strong></p><h3>b) Closure of client sites</h3><p>We will work with each client to understand their contingency plans in relation to Coronavirus. Specifically, we will work with our day-to-day contacts to ensure that they would be able to continue working with us in the event that they were unable to access their normal place of work. </p><p>For clients for whom we are doing active projects during the next eight weeks, we will undertake business continuity tests with them to ensure they are able to adequately access Zoom and other systems from their alternative workplaces (home, other offices etc).</p><p><strong>Update 17/3/20: This is now occurring for many of our clients.</strong></p><h3>c) Travel restrictions restricting face to face working </h3><p>We are undertaking a rolling two-week forward review of all planned on-site activities to identify how these could be run remotely should it be necessary to restrict travel or in the event of client site closure. Specific contingency plans for each planned on-site activity are <a  href=\"https://docs.google.com/spreadsheets/d/1kPwCD33iTOKcGmnyrMor55MjRb8x4TH4U736TOSZxN4/edit#gid=0\">here</a> (Deeson confidential).<br />Where necessary preparatory steps will be taken to enable these contingency arrangements to be put into place immediately. Such measures would be likely to include delivery of workshops over Zoom using remote collaboration tools. Planned workshops/interviews etc should only be cancelled as a last resort as this will have a knock-on effect on overall delivery plans.</p><p><strong>Update 17/3/20: This has now occurred and we have implemented our business continuity plan.</strong></p><h3>d) Higher than normal sickness among Deeson team members</h3><p>This might happen in extreme circumstances. We will be monitoring sickness levels each day. In the event of escalating sickness, the leadership team will review and make decisions on prioritisation of resources to maintaining client sites and project delivery as best we can.</p><p><strong>Update 17/3/20: This has not occurred but we continue to monitor sickness every day.</strong></p><h3>e) Client unavailable for extended period due to illness or inaccessible isolation </h3><p>We will plan with each of our clients for this situation and take prior mitigating steps that are specific to the type of work we are doing with them (foundations, build, ongoing support etc). Our priority will be to maintain delivery of client service as effectively as possible in these circumstances, while not compromising the quality of work we are doing and the overall project.</p><p><strong>Update 17/3/20: This has not occurred but we continue to monitor every day.</strong></p><p></p>","lastModified":"2020-08-20T10:17:07+0000","slices":[]}}}
